app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "content", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "Harry Potter"], ["content", "Harry poter is a magician"], ["category", "sci-fi"], ["created_at", "2024-09-10 19:08:51.890978"], ["updated_at", "2024-09-10 19:08:51.890978"]]

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "category" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["category", "sci-fiii"], ["updated_at", "2024-09-10 19:09:15.603958"], ["id", 1]]

  def destroy
    @book.destroy!
---
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]